1-تحلیل اولیه
طبق درخواست ها قرار شده به شکل کلی داده از خروجی HAP گرفته و به اکسل مد نظر وارد بشه 
2-گروه اولیه 
در حال حاضر 
آرمین عباس زاده به عنوان رهبر پروژه و تحلیل ان
اقای حسینی به عنوان برنامه نویس پروژه که روی بخش تشخیص گرفتن و قرار دادن داده کار می کنند
اقای اوجی به عنوان front برنامه نویس کار می کنند و قرار است برنامه رو چوری طراحی بکنند که کار باهاش اسان شود
خانم علیزاده روی سرعت گرفتن داده و قرار دادن ان روی تک هسته ای بودن برنامه کار می کنند
اقای عباسی روی اکسل نهایی و تبدیل خروجی HAP به اکسل کار می کنند
خانم منظوی به صورت چکر روند کار رو پیگیری و خروجی رو به اقای عباس زاده می دهد
3-منابع مورد نیاز اولیه
برای هر نفر یه عدد سیستم در نظر گرفته شده 
و نیاز من یک فرد از شرکت درخواست کننده هستیم که ساز کار برنامه HAP رو به ما اموزش بدهد
4-برنامه اولیه 
قرار شد طی 2 ماه وقت برای هر نفر بجز اقای حسینی که یک ماه وقت داده شد یک پروپزال اماده بشه که چه کار قرار هست بکنند و از کجا شروع کنیم
5-هزینه اولیه 
نداریم هزینه ای شرکت فقط نیاز دارد سیستم در اختیار گروه با اینترنت قرار بدهد تا پروپزال ها اماده شود و روند کار اغاز
6-ریسک های اولیه
شروع جنگ می تواند تاخیر در روند کار ایجاد کنند
